# WitnsLineGapToElt Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..WitnsLineGapToElt Property
ParameterTypeId Class See Also
---
"Witness Line Gap to Element"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId WitnsLineGapToElt { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property WitnsLineGapToElt As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ WitnsLineGapToElt {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace